{
    "recipes":[
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":false,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":22,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":7,
          "spoonacularScore":20,
          "healthScore":1,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":43.12,
          "extendedIngredients":[
             "Array"
          ],
          "id":633229,
          "title":"Baby Chick Cupcakes",
          "readyInMinutes":45,
          "servings":12,
          "sourceUrl":"https://www.foodista.com/recipe/MBXDGLS5/baby-chick-cupcakes",
          "image":"https://spoonacular.com/recipeImages/633229-556x370.jpg",
          "imageType":"jpg",
          "summary":"The recipe Baby Chick Cupcakes is ready <b>in around around 45 minutes</b> and is definitely a great <b>lacto ovo vegetarian</b> option for lovers of American food. For <b>43 cents per serving</b>, you get a dessert that serves 12. One portion of this dish contains roughly <b>4g of protein</b>, <b>22g of fat</b>, and a total of <b>454 calories</b>. This recipe is liked by 7 foodies and cooks. A mixture of food colouring, brown and orange m&ms, coconut, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by Foodista. With a spoonacular <b>score of 17%</b>, this dish is not so super. Similar recipes are <a href=\"https://spoonacular.com/recipes/baby-chick-cupcakes-371054\">Baby Chick Cupcakes</a>, <a href=\"https://spoonacular.com/recipes/mama-and-baby-chick-cupcakes-163839\">Maman and Baby Chick Cupcakes</a>, and <a href=\"https://spoonacular.com/recipes/baby-chick-cake-274567\">Baby Chick Cake</a>.",
          "cuisines":[
             "Array"
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             
          ],
          "instructions":"Heat oven to 180 C.  Put paper cases in 24 muffin tins (or halve the recipe and do 12, or bake 12 at a time). In a medium bowl, beat flour, sugar, butter, milk, baking powder, salt, vanilla and egg. Either beat 3 minutes with a mixer, or get that baking bicep out and mix by hand for a few minutes. fill paper cases half full. Bake 15-20 minutes until a toothpick inserted in the centre comes out clean. Cool completely on a rack. FROSTING: This is the fun part! add tablespoonsful of cream to the two cups of icing in a bowl, until it gets to the desired stage. Some people like runny, I prefer it a little stiff. Add a few drops of yellow food colouring and mix. Now for your chick feathers... add 2 cups coconut to a ziplock bag, drop in some food colouring, seal it up and rub it all with your fingers to dye the coconut. Fun! When cupcakes are completely cool, ice with yellow frosting. Put the coconut in a small bowl, and dip the cupcakes icing-side down into it to completely cover.  Add brown M&Ms for eyes, sticking on with a little frosting for glue. Poke orange M&Ms in for the beak... total cuteness.",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/baby-chick-cupcakes-633229"
       },
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":false,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":36,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":8,
          "spoonacularScore":44,
          "healthScore":8,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":383.1,
          "extendedIngredients":[
             "Array"
          ],
          "id":631762,
          "title":"Strawberry Tart",
          "readyInMinutes":45,
          "servings":4,
          "sourceUrl":"https://www.foodista.com/recipe/KQ3ZYRX2/strawberry-tart",
          "image":"https://spoonacular.com/recipeImages/631762-556x370.jpg",
          "imageType":"jpg",
          "summary":"`Strawberry Tart takes about <b>approximately 45 minutes</b> from beginning to end. This dessert has <b>846 calories</b>, <b>7g of protein</b>, and <b>41g of fat</b> per serving. This lacto ovo vegetarian recipe serves 4 and costs <b>$3.83 per serving</b>. A mixture of orange zest, strawberries, butter, and a handful of other ingredients are all it takes to make this recipe so delicious. 8 people were impressed by this recipe. <b>Mother's Day</b> will be even more special with this recipe. It is brought to you by Foodista. With a spoonacular <b>score of 43%</b>, this dish is solid. <a href=\"https://spoonacular.com/recipes/strawberry-tart-72628\">Strawberry Tart</a>, <a href=\"https://spoonacular.com/recipes/strawberry-tart-576549\">Strawberry Tart</a>, and <a href=\"https://spoonacular.com/recipes/strawberry-tart-386401\">Strawberry Tart</a> are very similar to this recipe.`",
          "cuisines":[
             
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             "Array"
          ],
          "instructions":"Preheat oven to 350 degrees F. Sift flour onto a board or into a bowl. Make a well in the center. Add the butter, water, egg yolk, sugar, vanilla, and orange zest. Work the ingredients in the center, drawing in the flour until the dough is smooth. Pat out the dough onto the bottom and sides of a pie plate. Prick the bottom and sides of the dough with a fork. Bake got 15-20 minutes, or until the pastry is light golden. Cool. To make the glaze, put the cherry preserves in a small saucepan and melt it slowly over low heat. Cool slightly and brush over the bottom of the pastry. Wash, hull and slice the strawberries. Fill the pie plate with the strawberries and top with remaining cherry glaze. Whip cream with 1 tablespoon of confectioners sugar until light and fluffy and serve with a slice of strawberry tart! Enjoy!",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/strawberry-tart-631762"
       },
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":false,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":17,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":6,
          "spoonacularScore":18,
          "healthScore":1,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":57.9,
          "extendedIngredients":[
             "Array"
          ],
          "id":639456,
          "title":"Cinnamon Eggless Coffee Cake",
          "readyInMinutes":45,
          "servings":6,
          "sourceUrl":"https://www.foodista.com/recipe/CJJNKPT5/cinnamon-eggless-coffee-cake",
          "image":"https://spoonacular.com/recipeImages/639456-556x370.jpg",
          "imageType":"jpg",
          "summary":"Cinnamon Eggless Coffee Cake is a <b>lacto ovo vegetarian</b> breakfast. This recipe serves 6 and costs 58 cents per serving. One portion of this dish contains around <b>5g of protein</b>, <b>18g of fat</b>, and a total of <b>375 calories</b>. If you have vanillan essence, curd, salt, and a few other ingredients on hand, you can make it. Not a lot of people made this recipe, and 6 would say it hit the spot. This recipe is typical of Southern cuisine. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. It is brought to you by Foodista. With a spoonacular <b>score of 15%</b>, this dish is not so tremendous. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/eggless-dates-walnut-coffee-cake-eggless-cake-s-486685\">eggless dates walnut coffee cake | eggless cake s</a>, <a href=\"https://spoonacular.com/recipes/eggless-apple-cinnamon-muffin-eggless-muffins-622027\">Eggless Apple Cinnamon Muffin | Eggless muffins</a>, and <a href=\"https://spoonacular.com/recipes/mug-cinnamon-coffee-cake-with-coffee-mate-extra-sweet-creamy-562548\">Mug Cinnamon Coffee Cake with Coffee-mate Extra Sweet & Creamy</a>.",
          "cuisines":[
             "Array"
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             
          ],
          "instructions":"Preheat the oven for 10 minutes at 180C. Grease a rectangular tin for baking the cake and keep it aside. Take a big vessel and sift the two kinds of flour with baking powder, coffee, powder, cinnamon powder and salt for at least three times. Take another vessel and beat powdered sugar and oil till it is light and fluffy , for about 10 minutes. Add the curd, coffee decoction, vanilla essence and vinegar in the sugar and oil mixture and stir it thoroughly. Keep 1 tsp. of sugar aside. Gently mix in the liquid mix in the dry flour. Mix the whole batter very lightly till it resembles a uniform paste. Do not over mix, just 10-12 strokes will do. Pour the prepared batter in the baking tin and sprinkle 1 tsp. of sugar over it. Bake it at 180C for about 25-30 minutes or till done. Insert a clean knife and take it out, if it comes clean the cinnamon tea cake is ready, else bake it for few more minutes. Take out of the oven and let it cool on a wire rack. Cut it in desired shape and serve with tea or coffee. Stays good for a week.",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/cinnamon-eggless-coffee-cake-639456"
       },
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":false,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":17,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":10,
          "spoonacularScore":48,
          "healthScore":7,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":65.1,
          "extendedIngredients":[
             "Array"
          ],
          "id":665303,
          "title":"Wholemeal Cake",
          "readyInMinutes":45,
          "servings":4,
          "sourceUrl":"https://www.foodista.com/recipe/JDYXYDJY/wholemeal-cake",
          "image":"https://spoonacular.com/recipeImages/665303-556x370.jpg",
          "imageType":"jpg",
          "summary":"`Wholemeal Cake could be just the <b>lacto ovo vegetarian</b> recipe you've been looking for. This recipe makes 4 servings with <b>432 calories</b>, <b>9g of protein</b>, and <b>27g of fat</b> each. For <b>65 cents per serving</b>, this recipe <b>covers 14%</b> of your daily requirements of vitamins and minerals. A couple people really liked this dessert. 10 people have made this recipe and would make it again. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. If you have brown sugar, sugar, flour, and a few other ingredients on hand, you can make it. Taking all factors into account, this recipe <b>earns a spoonacular score of 47%</b>, which is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/wholemeal-steam-bun-665306\">Wholemeal Steam Bun</a>, <a href=\"https://spoonacular.com/recipes/wholemeal-apple-cinnamon-scones-122784\">Wholemeal Apple & Cinnamon Scones</a>, and <a href=\"https://spoonacular.com/recipes/wholemeal-spinach-potato-pies-223882\">Wholemeal spinach & potato pies</a>.`",
          "cuisines":[
             
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             
          ],
          "instructions":"In a large bowl, mix ground hazelnut, brown sugar, plain flour and wholemeal flour together and set aside. Whisk egg whites and sugar at medium high speed till firm and smooth. Use hand to fold one quarter of beaten egg whites to the flour mixture evenly and remaining egg white in two batches. Lastly add in melted butter in two batches and mix well with a rubber spatula follow by the dried apricots and dried cranberries. Pour mixture into a 7 inch (lined) round cake pan and sprinkle more dried apricots and dried cranberries over it. Bake at preheated oven 170C for about 30-35 minutes or until skewer inserted comes out clean. Leave cake to cool in pan for 15 minutes and remove to wire rack to cool down completely.",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/wholemeal-cake-665303"
       },
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":true,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":392,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":9,
          "spoonacularScore":89,
          "healthScore":78,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":1158.05,
          "extendedIngredients":[
             "Array"
          ],
          "id":643426,
          "title":"Fresh Apple Cake With Caramel Sauce",
          "readyInMinutes":45,
          "servings":1,
          "sourceUrl":"https://www.foodista.com/recipe/DBJYD6L8/fresh-apple-cake-with-caramel-sauce",
          "image":"https://spoonacular.com/recipeImages/643426-556x370.jpg",
          "imageType":"jpg",
          "summary":"If you want to add more <b>lacto ovo vegetarian</b> recipes to your recipe box, Fresh Apple Cake With Caramel Sauce might be a recipe you should try. For <b>$11.58 per serving</b>, this recipe <b>covers 77%</b> of your daily requirements of vitamins and minerals. One serving contains <b>8596 calories</b>, <b>79g of protein</b>, and <b>456g of fat</b>. This recipe serves 1. Only a few people made this recipe, and 9 would say it hit the spot. It works well as a pricey dessert. If you have coconut, cinnamon, brown sugar, and a few other ingredients on hand, you can make it. It is brought to you by Foodista. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 90%</b>, which is spectacular. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/fresh-apple-cake-with-caramel-sauce-418753\">Fresh Apple Cake with Caramel Sauce</a>, <a href=\"https://spoonacular.com/recipes/fresh-apple-cake-with-caramel-glaze-599212\">Fresh Apple Cake with Caramel Glaze</a>, and <a href=\"https://spoonacular.com/recipes/fresh-apple-cake-with-caramel-cream-cheese-frosting-1035056\">Fresh Apple Cake with Caramel Cream Cheese Frosting</a>.",
          "cuisines":[
             
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             
          ],
          "instructions":"Mix together sugar and oil; add eggs; beat well. blend in flour, soda and salt. Add cinnamon and vanilla. Stir in apples, coconut, dates and pecans. Batter will be thick. Spoon into a 9\" or 10\" tube pan which has been greased and floured. Bake at 325 degrees for 1 1/2 hours, or until toothpick inserted comes out clean. Remove from oven and immediately pour caramel sauce over and allow to soak in. Cool cake completely before removing from pan. For caramel sauce, heat ingredients together. Boil for 2 minutes.",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/fresh-apple-cake-with-caramel-sauce-643426"
       },
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":false,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":3,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":8,
          "spoonacularScore":8,
          "healthScore":0,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":7.39,
          "extendedIngredients":[
             "Array"
          ],
          "id":653445,
          "title":"Oatmeal Coconut Cookies",
          "readyInMinutes":45,
          "servings":32,
          "sourceUrl":"https://www.foodista.com/recipe/PVVWD7DV/oatmeal-coconut-cookies",
          "image":"https://spoonacular.com/recipeImages/653445-556x370.jpg",
          "imageType":"jpg",
          "summary":"You can never have too many dessert recipes, so give Oatmeal Coconut Cookies a try. This lacto ovo vegetarian recipe serves 32 and costs <b>7 cents per serving</b>. One serving contains <b>78 calories</b>, <b>1g of protein</b>, and <b>4g of fat</b>. 8 people were glad they tried this recipe. Head to the store and pick up rolled oats, caster sugar, baking soda, and a few other things to make it today. It is brought to you by Foodista. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. Overall, this recipe earns a <b>very bad (but still fixable) spoonacular score of 4%</b>. Similar recipes are <a href=\"https://spoonacular.com/recipes/dark-chocolate-raspberry-coconut-oatmeal-cookies-made-with-coconut-oil-809865\">Dark Chocolate Raspberry Coconut Oatmeal Cookies (made with coconut oil!)</a>, <a href=\"https://spoonacular.com/recipes/coconut-oatmeal-cookies-719474\">Coconut Oatmeal Cookies</a>, and <a href=\"https://spoonacular.com/recipes/oatmeal-coconut-cookies-247148\">Oatmeal Coconut Cookies</a>.",
          "cuisines":[
             
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             
          ],
          "instructions":"Heat the oven to 150C/300F and prepare two baking trays covered with parchment. In a large bowl, stir together the oats, coconut, flour, sugar and salt. Meanwhile melt the butter and syrup together in a small pot over low heat. Stir the baking soda into the boiling water, then stir this into the butter and syrup mixture. And pour all of it over the flour mixture. Mix well, then shape the mixture into 32 balls and place onto the prepared baking sheets. Press down to flatten the cookie balls with your palm. Bake for 12-15 minutes, switching the pan around if you need to for even baking, until the cookies are golden brown. Leave them on the baking trays for 5 minutes before removing them with a spatula to cool on a rack.",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/oatmeal-coconut-cookies-653445"
       },
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":false,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":12,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":8,
          "spoonacularScore":29,
          "healthScore":3,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":49.48,
          "extendedIngredients":[
             "Array"
          ],
          "id":632570,
          "title":"Apple Pie Honey Wheat Scones",
          "readyInMinutes":45,
          "servings":8,
          "sourceUrl":"https://www.foodista.com/recipe/RC4GDVWJ/apple-pie-honey-wheat-scones",
          "image":"https://spoonacular.com/recipeImages/632570-556x370.jpg",
          "imageType":"jpg",
          "summary":"Apple Pie Honey Wheat Scones is an American breakfast. One serving contains <b>304 calories</b>, <b>5g of protein</b>, and <b>15g of fat</b>. This lacto ovo vegetarian recipe serves 8 and costs <b>49 cents per serving</b>. 8 people found this recipe to be yummy and satisfying. A mixture of heavy cream, salt, brandy, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by Foodista. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 27%</b>, which is not so tremendous. Try <a href=\"https://spoonacular.com/recipes/apple-scones-with-apple-pie-spice-icing-615946\">Apple scones with apple pie spice icing</a>, <a href=\"https://spoonacular.com/recipes/apple-scones-with-apple-pie-spice-icing-616368\">Apple scones with apple pie spice icing</a>, and <a href=\"https://spoonacular.com/recipes/whole-wheat-honey-apple-bundt-cake-601039\">Whole Wheat Honey Apple Bundt Cake</a> for similar recipes.",
          "cuisines":[
             "Array"
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             
          ],
          "instructions":"Preheat oven to 400 degrees. Line a baking sheet with parchment paper. In a large mixing bowl whisk together first 7 ingredients. Add fresh ginger and butter. Work everything together with your fingers until the mixture is in course crumbles. You want the butter to remain as cool as possible and still be in pieces. You can do this part with the food processor if you want, but I prefer to just mix by hand because you still have to transfer it all to a bowl, so it's less to clean up. Add the cream, egg, honey, vanilla, and brandy. Knead the dough until it comes together. Dump the apples in and press them into the dough until they are evenly distributed and you have a nice round ball of dough. As with any bread, handle it as little and as quickly as possible or the scones will be tough. On a floured surface flatten the dough ball into a one inch thick disc. Use just enough flour to keep it from sticking to your hands as this will dry out the dough. Cut the disc into 8 equal sections. Place scones on the baking sheet and sprinkle with Turbonado sugar. Bake for approximately 15 - 18 minutes or until they are golden brown. Melt butter and drizzle over the top of a warm scone. Oh my...scrumptious :) Transfer the rest to a wire rack to cool. Store in a sealed container or Ziploc bag. They also freeze well for 3 to 4 months.",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/apple-pie-honey-wheat-scones-632570"
       },
       {
          "vegetarian":true,
          "vegan":false,
          "glutenFree":false,
          "dairyFree":false,
          "veryHealthy":false,
          "cheap":false,
          "veryPopular":false,
          "sustainable":false,
          "weightWatcherSmartPoints":11,
          "gaps":"no",
          "lowFodmap":false,
          "aggregateLikes":7,
          "spoonacularScore":18,
          "healthScore":1,
          "creditsText":"Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
          "license":"CC BY 3.0",
          "sourceName":"Foodista",
          "pricePerServing":73.25,
          "extendedIngredients":[
             "Array"
          ],
          "id":631785,
          "title":"Impossible\" Coconut Pie",
          "readyInMinutes":45,
          "servings":10,
          "sourceUrl":"https://www.foodista.com/recipe/CBTKCKX4/impossible-coconut-pie",
          "image":"https://spoonacular.com/recipeImages/631785-556x370.jpg",
          "imageType":"jpg",
          "summary":"`Impossible\" Coconut Pie could be just the <b>lacto ovo vegetarian</b> recipe you've been looking for. This recipe serves 10 and costs 73 cents per serving. One serving contains <b>239 calories</b>, <b>3g of protein</b>, and <b>16g of fat</b>. 7 people were glad they tried this recipe. Not a lot of people really liked this dessert. A mixture of coconut milk, sugar, flour, and a handful of other ingredients are all it takes to make this recipe so delicious. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. It is brought to you by Foodista. Overall, this recipe earns a <b>rather bad spoonacular score of 15%</b>. Similar recipes are <a href=\"https://spoonacular.com/recipes/impossible-coconut-pie-560495\">Impossible Coconut Pie</a>, <a href=\"https://spoonacular.com/recipes/impossible-pie-327867\">Impossible Pie</a>, and <a href=\"https://spoonacular.com/recipes/impossible-pie-69737\">Impossible Pie</a>.`",
          "cuisines":[
             
          ],
          "dishTypes":[
             "Array"
          ],
          "diets":[
             "Array"
          ],
          "occasions":[
             
          ],
          "instructions":"Preheat oven to 170C. Place the eggs, sugar, butter, desiccated coconut, lemon and orange zest and juice, coconut milk and flour in a food processor and blend until well combined. Pour into a buttered 22cm (9 inch) pie tray. Place pie tray at the lower rack of the oven and bake for 60 - 80 minutes. Loosely cover with aluminium foil when you find the pie turning brown during half way of baking.  Set aside to cool, then refrigerate for 1 hour to chill. Slice and serve with a little whipped cream and passionfruit or  blueberry jam and sprinkle some toasted desiccated coconut over it.",
          "analyzedInstructions":[
             "Array"
          ],
          "originalId":null,
          "spoonacularSourceUrl":"https://spoonacular.com/impossible-coconut-pie-631785"
       }
    ]
 }